---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.IDirectContext3DServer
source: html/74403a34-8606-c60a-20b5-6be375621753.htm
---
# IDirectContext3DServer Methods

Can be used to allow the server to execute only in certain views.